export const defaultText = '--';

export const unearned = {
  YES: '预收',
  NO: '不预收'
};

export const allInclusive = {
  YES: '包干类',
  NO: '普通类'
};

export const exceptionCateMap = {
  1: '推送资金平台',
  2: '接受放款通知',
  3: '装修代偿回调',
  4: '接受抵扣通知',
  5: '房产订单收款完成回调',
  6: '打款成功通知',
  7: '接受签约通知',
  9: '推送业绩',
  10: '接受提审',
  11: '放款退票',
  12: '提前还款完成',
  13: '推送链家收费信息',
  14: '推送风控预收项收齐',
  15: '推送收费信息',
  16: '推送风控收费信息',
  17: '推送金融单收费信息',
  18: '推送金融单贷款状态变成还款完成',
  19: '还款计划变更',
  20: '正常还款推送',
  21: '推送退款状态变更信息',
  22: '推送金融单退款状态变更信息',
  23: '推送风控退款状态变更信息',
  24: '推送还款计划',
  25: '线上收费成功回调',
  26: '推送资金平台子还款计划',
  27: '通知装修租赁退款账单有变化',
  28: '通知安心退线下收款成功',
  29: '代扣结果通知',
  30: '还款计划终态通知',
  31: '资金平台装修微众代扣结果通知',
  32: '还款完成推送资金平台'
};

export const exceptionStatusMap = {
  1: '处理中',
  2: '处理成功',
  3: '处理失败',
  4: '已修复',
  10: '已受理',
  11: '受理失败'
};

export const retryStatusMap = {
  1: '重试中',
  2: '重试完成'
};

// 混合收费
export const RATIO_TYPE = {
  amount: '金额',
  ratio: '利率'
};

export const external = 'YES'; // 外部系统传参 只接受YES参数
export const capital = 1000; // 本金 如果后端本金改了  这里也需要修改
export const interest = 1006; // 利息 如果后端利息改了  这里也需要修改
